---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.ConnectionInputPoint
source: html/6b7e1cf8-9c48-5c39-3c42-b965a4501a3a.htm
---
# ConnectionInputPoint Properties

Unique id of this input point.